# Забавные строки
# Демонстрирует сцепление и повторение строк
print("Две строки можно " + "сцепить с помощью оператора '+'. ")
print("\nЭта строка " + "вряд ли " + "удив" + "ит вас." \
      + "Но инетресно. " + "что " + "она - \n" + "одна длинная-длин"\
      + "на" + "я" + "строка. сцепленная " \
      + "из" + "двадцати двух\n" + "отдельных строк. разбитых" \
      + "на шесть строк." + "достаточно ли вы" + "впечатлены?" + "ну хватит.\n" \
      + "вот " + "наша " + "длинная" + "строка закончилась!")
print("\nЕсли текст нарвится. его можно и повторять. К примеру.")
print("Кто не любит пирожных? Только дураки не любят пирожных. А")
print("А раз мі люди честные. то выскажемся о своих симпатиях")
print("откровенно:")
print("откровенно " *10)
input("\n\nНажмите Enter. чтобы выйти.")
